Revit 2026 API

# ConnectorAssignedFixtureUnits Property

---

The assigned fixture units of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AssignedFixtureUnits { get; set; }
```
```vb
Public Property AssignedFixtureUnits As Double
	Get
	Set
```
```cpp
public:
property double AssignedFixtureUnits {
	double get ();
	void set (double value);
}
```
```fsharp
member AssignedFixtureUnits : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance. |
| ArgumentException | Thrown when set an invalid value. |
| InvalidOperationException | Thrown on failure to get or set assigned fixture units. |

Assigned fixture units may be assigned for connectors of some family instances.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace